app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts" ORDER BY "workouts"."name" ASC
---
  def index
    @workouts = Workout.all.order(:name)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."impact" = $1  [["impact", "High"]]
---
  def high_impact
    @workouts = Workout.where(impact: "High").sample(9)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."impact" = $1  [["impact", "Low"]]
---
  def low_impact
    @workouts = Workout.where(impact: "Low").sample(9)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."focus" = $1  [["focus", "Core"]]
---
  def core_blast
    @workouts = Workout.where(focus: "Core").sample(10)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."focus" = $1  [["focus", "Lower"]]
---
  def leg_day
    @workouts = Workout.where(focus: "Lower").sample(10)

SELECT "workouts".* FROM "workouts"
---
  def surprise_me
    @workouts = Workout.all.sample(15)

INSERT INTO "workouts" ("name", "impact", "fitness_type", "focus", "img", "demo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @workout = Workout.new(workout_params)

    if @workout.save

DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 10]]
---
  def destroy
    @workout.destroy

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_workout
      @workout = Workout.find(params[:id])