app/controllers/workouts_controller.rb

  def create
    @workout = Workout.new(workout_params)

    if @workout.save
---
INSERT INTO "workouts" ("name", "impact", "fitness_type", "focus", "img", "demo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @workout.destroy
---
DELETE FROM "workouts" WHERE "workouts"."id" = $1  [["id", 6]]

    def set_workout
      @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]